FILES/DataProcessors/ЭкспортИмпортНастроекЗагрузкиИОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<DataProcessor>
		<Properties>
			<Name>ЭкспортИмпортНастроекЗагрузкиИОбъектов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастройкаЗагрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиЗагрузокУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаЭлемент</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокИсключений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

FILES/DataProcessors/ЭкспортИмпортНастроекЗагрузкиИОбъектов/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Функция ЭкспортНастроекНаСервере()
	//ОбъектСервер = РеквизитФормыВЗначение("Объект");
	//РезультатРаботы = ОбъектСервер.ЭкспортНастройки(Объект.НастройкаЗагрузки);
	РезультатРаботы = УправлениеБТСервер.ЭкспортНастройки(Объект.НастройкаЗагрузки);
	Возврат РезультатРаботы;
КонецФункции

&НаКлиенте
Процедура ВыполнитьПослеВыбораФайлаСохранение(Пар1, Пар2) Экспорт
	
	Если ТипЗнч(Пар1) = Тип("Массив") Тогда
		
		Для Каждого ИмяФайла Из Пар1 Цикл
			СодержимоеФайла = ЭкспортНастроекНаСервере();
			ТД = Новый ТекстовыйДокумент;
			ТД.УстановитьТекст(СодержимоеФайла);
			ТД.Записать(ИмяФайла+"\"+Строка(Объект.НастройкаЗагрузки)+".json", КодировкаТекста.UTF8);
		КонецЦикла;
		
	Иначе
	    ПоказатьПредупреждение(,НСтр("ru = 'Каталог не выбран!'; en = 'Directory not selected!'"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЭкспортНастроек(Команда)
	
	Если Строка(Объект.НастройкаЗагрузки) = "" Тогда
		ПоказатьПредупреждение(Неопределено, "У вас не выбрана настройка для выгрузки");
	Иначе
		Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
		ДиалогОткрытияФайла.ПолноеИмяФайла = "";
		
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		ДиалогОткрытияФайла.Заголовок = "Выберите каталог";
		
		Оп = Новый ОписаниеОповещения("ВыполнитьПослеВыбораФайлаСохранение", ЭтотОбъект, "");
		ДиалогОткрытияФайла.Показать(Оп);
	КонецЕсли;
	
КонецПроцедуры






&НаСервере
Функция ИмпортНастроекНаСервере(СодержимоеФайла)
	//ОбъектСервер = РеквизитФормыВЗначение("Объект");
	//РезультатРаботы = ОбъектСервер.ИмпортНастройки(СодержимоеФайла, Объект.НастройкаЗагрузки);	
	РезультатРаботы = УправлениеБТСервер.ЭкспортНастройки(Объект.НастройкаЗагрузки);
	Возврат РезультатРаботы;
КонецФункции

&НаКлиенте
Процедура ВыполнитьПослеВыбораФайлаОткрытие(Пар1, Пар2) Экспорт
	
	Если ТипЗнч(Пар1) = Тип("Массив") Тогда
		
		Для Каждого ИмяФайла Из Пар1 Цикл
			ТД = Новый ТекстовыйДокумент;
			ТД.НачатьЧтение(Новый ОписаниеОповещения("ВыполнитьПослеВыбораФайлаОткрытиеЗавершение", ЭтотОбъект, Новый Структура("ТД", ТД)), ИмяФайла);
		КонецЦикла;
		
	Иначе
	    ПоказатьПредупреждение(,НСтр("ru = 'Файл не выбран!'; en = 'File not selected!'"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораФайлаОткрытиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТД = ДополнительныеПараметры.ТД;
	СодержимоеФайла = ТД.ПолучитьТекст();
	ИмпортНастроекНаСервере(СодержимоеФайла);

КонецПроцедуры

&НаКлиенте
Процедура ИмпортНастроек(Команда)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = "Внешняя обработка (*.json)|*.json";
	
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	
	Оп = Новый ОписаниеОповещения("ВыполнитьПослеВыбораФайлаОткрытие", ЭтотОбъект, "");
	ДиалогОткрытияФайла.Показать(Оп);
	
КонецПроцедуры





&НаКлиенте
Функция ВыполнитьПриПоискеФайлов(НайденныеФайлы, ДополнительныеПараметры) Экспорт
	
	Для Каждого ИмяФайла ИЗ НайденныеФайлы Цикл 
		ТД = Новый ТекстовыйДокумент;
		ТД.НачатьЧтение(Новый ОписаниеОповещения("ВыполнитьПриПоискеФайловЗавершение", ЭтотОбъект, Новый Структура("ИмяФайла, ТД", ИмяФайла, ТД)), ИмяФайла.ПолноеИмя);
	КонецЦикла;
														
КонецФункции

&НаКлиенте
Процедура ВыполнитьПриПоискеФайловЗавершение(Результат, ДополнительныеПараметры1) Экспорт
	
	ИмяФайла = ДополнительныеПараметры1.ИмяФайла;
	ТД = ДополнительныеПараметры1.ТД;
	
	
	СодержимоеФайла = ТД.ПолучитьТекст();
	ИмпортНастроекНаСервере(СодержимоеФайла);
	Сообщить("Загружено: "+ИмяФайла.ПолноеИмя);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмпортКаталогаСНастройкамиНаСервере(Пар1, Пар2) Экспорт
	
	Если ТипЗнч(Пар1) = Тип("Массив") Тогда
		
		Для Каждого ИмяФайла Из Пар1 Цикл
			
			Оп = Новый ОписаниеОповещения("ВыполнитьПриПоискеФайлов", ЭтотОбъект, "");
			НачатьПоискФайлов(Оп, ИмяФайла, "*.json", Истина) 
			
		КонецЦикла;
		
	Иначе
	    Сообщить(НСтр("ru = 'Каталог не выбран!'; en = 'Directory not selected!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмпортКаталогаСНастройками(Команда)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите каталог";
	
	Оп = Новый ОписаниеОповещения("ИмпортКаталогаСНастройкамиНаСервере", ЭтотОбъект, "");
	ДиалогОткрытияФайла.Показать(Оп);
КонецПроцедуры




&НаСервере
Процедура ПолучитьГУИДНаСервере()
	// Вставить содержимое обработчика.
	Объект.ГУИД = Объект.СсылкаНаЭлемент.УникальныйИдентификатор();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьГУИД(Команда)
	ПолучитьГУИДНаСервере();
КонецПроцедуры

&НаСервере
Функция Команда1НаСервере()
	
	СписокИсключений = Новый Массив;
	Если Объект.СписокИсключений <> "" Тогда	
		ЧтениеJSON = Новый ЧтениеJSON; 
		ЧтениеJSON.УстановитьСтроку(Объект.СписокИсключений);
		СписокИсключений = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
	КонецЕсли;
	
	Описание = УправлениеБТСервер.ВернутьОписаниеСсылки(Объект.СсылкаНаЭлемент, СписокИсключений);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Описание);
	Результат = ЗаписьJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Команда1(Команда)
	Описание = Команда1НаСервере();
	
	ТД = Новый ТекстовыйДокумент;
	ТД.УстановитьТекст(Описание);
	ТД.Показать();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Макет = Обработки.ЭкспортИмпортНастроекЗагрузкиИОбъектов.ПолучитьМакет("НеиспользуемыеРеквизиты");
	Объект.СписокИсключений = Макет.ПолучитьТекст();
	
КонецПроцедуры
